# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities, `find`, `locate`... 
brew 'coreutils'
brew 'findutils'

# pbcopy and pbpaste works on tmux
brew 'reattach-to-user-namespace'

# Install bash 4
brew 'bash'

# Install tmux
brew 'tmux'

# Install more recent versions of some macOS tools
brew 'grep'

# Binaries
brew 'git'
brew 'hub'
brew 'tree'
brew 'trash'
brew 'wget'

# Development
brew 'nvm'
brew 'yarn', args: ['ignore-dependencies']
brew 'httpie'

# Apps
cask 'iterm2'
cask 'firefox'
cask 'google-chrome'
cask 'webstorm'
cask 'sketch'
cask 'sketch-toolbox'
cask 'docker'
cask 'spotify'
cask 'skype'

# Fonts
cask 'font-inconsolata'
cask 'font-inconsolata-for-powerline'
cask 'font-open-sans'
